import connection from "./plugins/connection";

export const handler = async (event: any, context: any, callback: any): Promise<any> => {
  // TODO implement
  const userId = event.request?.userAttributes['custom:userId']
  // if (userId) {
  const db = await connection();

  const repository = db?.vwUserRole;
  const userRole = await repository.find({
    where: { user_id: userId },
    select: ['role_name']
  });

  const roles = userRole?.map((user: any) => user.role_name);
  const strRole = roles.join('|');

  console.log(event);
  event.response = {
    claimsOverrideDetails: {
      claimsToAddOrOverride: {
        // roles: 'Admin|Driver',
        roles: strRole,
      },
      // claimsToSuppress: ['email'],
    },
  };
  // }

  // Return to Amazon Cognito
  callback(null, event);
};

/*
{
  "duration": 733,
  "problem": null,
  "originalError": null,
  "ok": true,
  "status": 200,
  "headers": {
      "content-type": "application/json;charset=UTF-8",
      "transfer-encoding": "chunked",
      "date": "Wed, 02 Jun 2021 08:09:37 GMT"
  },
  "config": {
      "url": "api/v1/users/auth/otp-verify",
      "method": "post",
      "data": "{\"token\":\"eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIrNjY5MjYyNzA0NjgiLCJBVVRIIjoiOTczNEBANyIsImV4cCI6MTYyMjYyMTU0OH0.IKDf3F1YYaqZECm09jOUD5mktfjpF6ZpAM4hONxqgU7AQD122lUvai3SvcxGY-A0s_9ilr13ehtqtQ_yUkYpnQ\",\"otp\":\"9734\"}",
      "headers": {
          "Accept": "application/json",
          "Content-Type": "application/json"
      },
      "baseURL": "https://staging.cargolink.co.th/",
      "transformRequest": [
          null
      ],
      "transformResponse": [
          null
      ],
      "timeout": 10000,
      "xsrfCookieName": "XSRF-TOKEN",
      "xsrfHeaderName": "X-XSRF-TOKEN",
      "maxContentLength": -1
  },
  "data": {
      "message": "",
      "responseCode": 1,
      "userProfile": {
          "id": 611,
          "userId": "RZDRR0KX",
          "companyName": "Fast Delivery",
          "fullName": "Fast Delivery",
          "mobileNo": "0926270468",
          "email": "mymail.example@mail.com",
          "avatar": null
      },
      "token": {
          "accessToken": "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiI2MTEiLCJBVVRIIjpbeyJhdXRob3JpdHkiOiJSRVNFVF9QV0QifSx7ImF1dGhvcml0eSI6IlZJRVdfVkVISUNMRSJ9LHsiYXV0aG9yaXR5IjoiQUREX09SREVSIn0seyJhdXRob3JpdHkiOiJMSVNUX1RSSVAifSx7ImF1dGhvcml0eSI6IlJFR19BQ0MifSx7ImF1dGhvcml0eSI6Ik1PRElGWV9EUklWRVIifSx7ImF1dGhvcml0eSI6IlJPTEVfU0hJUFBFUiJ9LHsiYXV0aG9yaXR5IjoiTU9ESUZZX1JPVVRFIn0seyJhdXRob3JpdHkiOiJTT0ZUX0RFTEVURV9WRUhJQ0xFIn0seyJhdXRob3JpdHkiOiJTT0ZUX0RFTEVURV9ST1VURSJ9LHsiYXV0aG9yaXR5IjoiUk9MRV9DQVJSSUVSIn0seyJhdXRob3JpdHkiOiJDT05GSVJNX09SREVSIn0seyJhdXRob3JpdHkiOiJNT0RJRllfSU5GTyJ9LHsiYXV0aG9yaXR5IjoiU09GVF9ERUxFVEVfT1JERVIifSx7ImF1dGhvcml0eSI6IlNJR05PVVQifSx7ImF1dGhvcml0eSI6IlJFUExZX09SREVSIn0seyJhdXRob3JpdHkiOiJSRVBPUlRfVFJBTlMifSx7ImF1dGhvcml0eSI6IlZFUklGWV9DT05UQUNUIn0seyJhdXRob3JpdHkiOiJBRERfVFJJUCJ9LHsiYXV0aG9yaXR5IjoiTElTVF9WRUhJQ0xFIn0seyJhdXRob3JpdHkiOiJVUERBVEVfUFJPRklMRSJ9LHsiYXV0aG9yaXR5IjoiTElTVF9EUklWRVIifSx7ImF1dGhvcml0eSI6IkFERF9EUklWRVIifSx7ImF1dGhvcml0eSI6IkNIQU5HRV9QV0QifSx7ImF1dGhvcml0eSI6IkRFVEFJTF9UUkFOUyJ9LHsiYXV0aG9yaXR5IjoiTU9ESUZZX09SREVSIn0seyJhdXRob3JpdHkiOiJTSUdOSU4ifSx7ImF1dGhvcml0eSI6IlNPRlRfREVMRVRFX0RSSVZFUiJ9LHsiYXV0aG9yaXR5IjoiTU9ESUZZX1ZFSElDTEUifSx7ImF1dGhvcml0eSI6IlVQTE9BRF9ET0NTIn0seyJhdXRob3JpdHkiOiJBRERfVFJBTlMifSx7ImF1dGhvcml0eSI6IkFERF9WRUhJQ0xFIn0seyJhdXRob3JpdHkiOiJBU1NJR05fVkVISUNMRV9EUklWRVIifSx7ImF1dGhvcml0eSI6IkxJU1RfT1JERVIifSx7ImF1dGhvcml0eSI6IkFERF9ST1VURSJ9XSwiZXhwIjoxNjI1MjEzMzc3fQ.wOz5b9ruKc1ue8laKDilbM0ABn_1aoTOK5HJj0l-7qMkCPS1tTPOi9cvA8dCXYWcFfcka_hcx5NXyyzrKbodHw",
          "idToken": "",
          "refreshToken": ""
      },
      "termOfService": {
          "version": "0.0.1",
          "accepted": true,
          "acceptedAt": "06-01-2021 13:49",
          "data": `<ol style=\"margin: 0px 0px 1.5em; padding-left: 1.6em; color: rgb(34, 34, 34); font-family: Sarabun, sans-serif; font-size: 16px;\"><li><span style=\"font-weight: bolder;\">เงื่อนไขและข้อตกลงการใช้บริการ</span></li></ol><p style=\"padding: 0px; margin-bottom: 1em; color: rgb(34, 34, 34); font-family: Sarabun, sans-serif; font-size: 16px;\"><span style=\"font-weight: bolder;\">ข้อ&nbsp;</span><span style=\"font-weight: bolder;\">1:</span>&nbsp;<span style=\"font-weight: bolder;\">บทนำสำคัญ</span></p><ol style=\"margin: 0px 0px 1.5em; padding-left: 1.6em; color: rgb(34, 34, 34); font-family: Sarabun, sans-serif; font-size: 16px;\"><li>1.1 แพลตฟอร์ม Cargo Link อยู่ที่ https://cargolink.co.th (“Platform”) และแอปพลิเคชั่นมือถือที่เกี่ยวข้อง (“Mobile App”) เป็นลิขสิทธิ์ทรัพย์สินของบริษัท คาร์โก้ ลิ้งค์ เทคโนโลยี่ จำกัด (“ผู้ให้การอนุญาต”) เพื่อความสะดวก ให้เรียก Platform รวมกันกับ Mobile App ว่า “Platform”) บริษัท คาร์โก้ ลิ้งค์ โลจิสติกส์ จำกัด (ต่อไปนี้จะเรียกว่า “Cargo Link”) เป็นบริษัทย่อยของผู้ให้การอนุญาต ซี่งได้รับอนุญาตจากผู้ให้การอนุญาต เพื่อให้ใช้ Platform ในการทำธุรกิจตามที่ระบุไว้ในที่นี้<br>1.2 Cargo Link ให้บริการขนส่ง ตามที่อธิบายไว้ในที่นี้สำหรับเจ้าของสินค้า (“บริการขนส่ง”) เพื่อวัตถุประสงค์นี้ Cargo Link ให้บริการ Platform ออนไลน์ ซึ่งรวมถึงฟังก์ชั่นทั้งหมดในที่นี้ ซึ่งช่วยให้เจ้าของสินค้าที่มีความต้องการในการขนส่งสินค้าตามรายการที่ต้องการ และ/หรือเลือกผู้รับเหมาของ Cargo Link (“ผู้รับเหมา”) ที่สามารถให้บริการขนส่งสินค้า และยังอนุญาตให้ผู้รับเหมาที่ให้บริการขนส่งรับเหมาในการแสดงรายการบริการของตน และ/หรือยอมรับการจัดส่งสินค้าบน Platform (รวมเรียกว่า “บริการ Platform”)&nbsp; การใช้บริการ Platform อาจมีการตรวจสอบและอนุมัติจากผู้ใช้งาน และแนวทางเพิ่มเติม, เงื่อนไข หรือกฎต่างๆ รวมถึง แต่ไม่จำกัดเฉพาะเพียง ข้อตกลงที่เกิดขึ้นระหว่าง Cargo Link กับเจ้าของสินค้า หรือผู้รับเหมา และนโยบายความเป็นส่วนตัวของ Cargo Link ที่มีให้ที่นี่ ทั้งนี้แนวทางเพิ่มเติม, เงื่อนไข หรือกฎต่างๆ ทั้งหมดนั้น รวมอยู่ในข้อตกลงนี้แล้ว<br>1.3 ยกเว้นในกรณีที่บริบทเป็นอย่างอื่น ในข้อตกลงนี้ผู้รับเหมาของ Cargo Link บน Platform ต่อไปนี้ จะเรียกว่า “ผู้ให้บริการขนส่ง”&nbsp;<br>คำที่แสดงถึงเอกพจน์ รวมถึงพหูพจน์ และในทางกลับกัน คำที่แสดงถึงเพศสภาพรวมถึงเพศใดๆ และคำที่แสดงถึงบุคคล รวมถึงบริษัท&nbsp;<br>และองค์กร และในทางกลับกัน<br>1.4 ผู้ใช้งาน รวมถึงบุคคลใดๆ ที่เข้าถึง Platform และใช้บริการ Platform&nbsp; ดังกล่าว และอาจเป็นผู้ให้บริการขนส่ง, เจ้าของสินค้า หรือคนขับ หรือตัวแทนของทั้งสองฝ่าย ในขอบเขตที่คุณเป็นผู้ให้บริการขนส่ง ข้อปฏิบัติในข้อตกลงนี้เกี่ยวกับผู้ให้บริการขนส่งจะมีผลบังคับใช้กับคุณ ในขอบเขตที่คุณเป็นเจ้าของสินค้า ข้อปฏิบัติในข้อตกลงนี้เกี่ยวกับเจ้าของสินค้าจะมีผลใช้บังคับกับคุณ ในขอบเขตที่คุณเป็นคนขับ ข้อปฏิบัติในข้อตกลงนี้เกี่ยวกับคนขับจะมีผลใช้บังคับกับคุณ ในขอบเขตที่คุณเป็นผู้ใช้งาน ข้อปฏิบัติในข้อตกลงนี้เกี่ยวกับผู้ใช้งานจะมีผลใช้บังคับกับคุณ<br>1.5 เงื่อนไขและข้อตกลงการใช้บริการนี้ ซึ่งอาจมีการแก้ไขเป็นครั้งคราวขึ้นอยู่กับดุลยพินิจของ Cargo Link (“ข้อตกลง”) ที่กำหนดไว้ในข้อกำหนด และเงื่อนไข มีผลผูกพันตามกฎหมายสำหรับการใช้บริการ Platform ของคุณ<br>1.6 ในการเข้าถึง หรือใช้บริการ Platform คุณยอมรับข้อตกลงนี้ในนามของตัวคุณเอง หรือบริษัท, นิติบุคคล หรือองค์กรที่คุณเป็นตัวแทน และคุณรับรอง และรับประกันว่าคุณมีสิทธิ์, อำนาจ และความสามารถในการทำข้อตกลงนี้ในนามของคุณเอง หรือในนามบริษัท, นิติบุคคล หรือองค์กรที่คุณเป็นตัวแทน คุณไม่สามารถเข้าถึง หรือใช้บริการ Platform หรือยอมรับข้อตกลงนี้ หากคุณมีอายุต่ำกว่าสิบแปด (18) ปี หรือเป็นบุคคลใดๆ ที่ถูกห้ามมิให้ลงนามในสัญญา โดยการใช้บริการ Platform นี้คุณยืนยันว่าข้อมูลทั้งหมดที่คุณให้นั้นเป็นความจริง และถูกต้อง คุณตกลงที่จะไม่อนุญาตให้ผู้อื่นใช้ข้อมูลประจำตัว หรือสถานะผู้ใช้งานของคุณ และคุณจะไม่มอบหมาย หรือโอนบัญชีผู้ใช้งานของคุณไปยังบุคคล หรือนิติบุคคลอื่นใด เมื่อใช้บริการ Platform คุณตกลงที่จะปฏิบัติตามกฎหมายที่บังคับใช้ทั้งหมด ไม่ว่าจะเป็นในบ้านเกิด, เมือง, รัฐ, ประเทศ หรือในสถานที่ใดๆ ที่คุณใช้งานอยู่&nbsp;<br>1.7 คุณสามารถเข้าถึงบริการ Platform โดยใช้วิธีการที่ได้รับอนุญาตเท่านั้น ทั้งนี้เป็นความรับผิดชอบของคุณในการตรวจสอบ และทำให้แน่ใจว่าคุณได้ดาวน์โหลดซอฟต์แวร์ที่ถูกต้องสำหรับอุปกรณ์ของคุณ Cargo Link ขอสงวนสิทธิ์ที่จะไม่อนุญาตให้คุณใช้บริการ Platform นี้ หากคุณใช้แอปพลิเคชั่นและ/หรือซอฟต์แวร์กับอุปกรณ์ที่เข้ากันไม่ได้ หรืออุปกรณ์ที่ไม่ได้รับอนุญาต หรือเพื่อวัตถุประสงค์อื่นนอกเหนือจากที่ซอฟต์แวร์และ/หรือแอปพลิเคชั่นระบุวัตถุประสงค์ให้ใช้<br>1.8 หากคุณไม่เห็นด้วยกับข้อกำหนดและเงื่อนไขทั้งหมดที่ระบุไว้ในที่นี้ กรุณาอย่าเข้าใช้ Platform หรือใช้บริการ Platform นี้<br>ข้อพิพาท หรือการโต้แย้งทั้งหมดที่อาจเกิดขึ้นกับข้อตกลงนี้จะได้รับการจัดการ โดยการแก้ไขหรือการตัดสินโดยอนุญาโตตุลาการเป็นรายบุคคล ยกเว้นศาลยุติธรรมใดๆ และจำกัดการเยียวยาที่มีให้ในกรณีที่มีข้อพิพาทเกิดขึ้น</li></ol><p style=\"padding: 0px; margin-bottom: 1em; color: rgb(34, 34, 34); font-family: Sarabun, sans-serif; font-size: 16px;\"><span style=\"font-weight: bolder;\">ข้อ 2 : คำอธิบายของบริการ Platform</span></p><ol style=\"margin: 0px 0px 1.5em; padding-left: 1.6em; color: rgb(34, 34, 34); font-family: Sarabun, sans-serif; font-size: 16px;\"><li>2.1 ทั่วไป: Cargo Link ให้บริการขนส่งผ่าน Platform ที่อนุญาตให้เจ้าของสินค้าโพสต์คำขอขนส่ง, ข้อเสนอตอบกลับ และยอมรับใบเสนอราคา ที่กำหนดโดยผู้ให้บริการขนส่งในนามของ Cargo Link และผู้ให้บริการขนส่งสามารถโพสต์ข้อเสนอการขนส่ง, ส่งใบเสนอราคา หรือยอมรับข้อเสนอตอบกลับของเจ้าของสินค้าในนามของ Cargo Link<br>2.2 คำขอขนส่ง: เจ้าของสินค้าจะโพสต์คำขอขนส่งสำหรับส่งสินค้า “การจัดส่ง” บน Platform โดยเจ้าของสินค้าควรให้ข้อมูลที่เกี่ยวข้องทั้งหมดเกี่ยวกับการจัดส่งตามที่จำเป็นสำหรับการโพสต์คำขอในบริการ Platform เมื่อยอมรับคำขอขนส่งสำหรับการโพสต์โดย Cargo Link รายละเอียดของคำขอขนส่งจะถูกโพสต์ไปยังบริการ Platform หลังจากระยะเวลาหนึ่งคำขอขนส่งจะสามารถแสดงให้ผู้ให้บริการขนส่งทั้งหมด หรือผู้ให้บริการขนส่งบางรายเพื่อตอบสนองความต้องการเฉพาะของเจ้าของสินค้า ผู้ให้บริการขนส่งอาจดูรายการคำขอขนส่งที่มีอยู่ในพื้นที่ของพวกเขาได้ตลอดเวลา และส่งใบเสนอราคาเพื่อตอบสนองคำขอขนส่งผ่านบริการ Platform ผู้ให้บริการขนส่งควรให้ข้อมูลที่จำเป็นทั้งหมดตามที่จำเป็นสำหรับการโพสต์ใบเสนอราคาในบริการ Platform<br>ผู้ให้บริการขนส่งที่มีใบเสนอราคาที่ได้รับการยอมรับโดยเจ้าของสินค้าจะได้รับการรับเหมาให้ดำเนินการตามคำขอขนส่ง เมื่อสรุปธุรกรรมบน Platform, ระบบบริการ Platform จะแจ้งเตือนให้ผู้ให้บริการขนส่งทราบว่าใบเสนอราคาได้รับการยอมรับแล้ว เจ้าของสินค้า และผู้ให้บริการขนส่งจะได้รับข้อมูลการติดต่อและหมายเลขโทรศัพท์ของกันและกัน เจ้าของสินค้า และผู้ให้บริการขนส่งแต่ละรายมีหน้าที่จัดหาและใช้โทรศัพท์ของตนเองเพื่อใช้กับการดำเนินงาน และการปฏิบัติงานของบริการขนส่ง ซึ่ง Cargo Link อาจจะเชื่อมระหว่างเจ้าของสินค้า และผู้ให้บริการขนส่งจากภายนอกบริการ Platform เป็นครั้งคราว<br>เจ้าของสินค้า และผู้ให้บริการขนส่ง จะต้องรับผิดชอบข้อมูลในคำขอขนส่ง และใบเสนอราคา โดย Cargo Link จะไม่รับผิดชอบต่อข้อมูลใดๆ ในคำขอขนส่ง และใบเสนอราคา และ Cargo Link ไม่รับประกันว่าคำขอขนส่งจะถูกเสนอโดยผู้ให้บริการขนส่ง และเจ้าของสินค้าจะยอมรับใบเสนอราคา<br>เจ้าของสินค้า และผู้ให้บริการขนส่ง อาจยกเลิกคำขอขนส่ง และใบเสนอราคาเมื่อใดก็ได้ ก่อนที่เจ้าของสินค้าจะชำระเงินให้กับ Platform และผู้ให้บริการขนส่งได้รับการแจ้งเตือน หรือได้รับอีเมลจาก Cargo Link เพื่อแจ้งให้ทราบว่าเจ้าของสินค้าได้ยอมรับใบเสนอราคาของผู้ให้บริการขนส่ง<br>2.3 ข้อเสนอการขนส่ง: ผู้ให้บริการขนส่งอาจโพสต์ข้อเสนอการขนส่งสินค้าในบริการ Platform ผู้ให้บริการขนส่งควรให้ข้อมูลที่เกี่ยวข้องทั้งหมดเกี่ยวกับรถบรรทุก และการเดินทางตามที่จำเป็นสำหรับการโพสต์ข้อเสนอการขนส่งสินค้าในบริการ Platform เมื่อข้อเสนอการขนส่งจากการโพสต์โดย Cargo Link ได้รับการยอมรับ รายละเอียดของข้อเสนอการขนส่งจะถูกโพสต์ลงในบริการ Platform หลังจากระยะเวลาหนึ่งแล้วข้อเสนอการขนส่งจะแสดงให้เจ้าของสินค้าทั้งหมด หรือเจ้าของสินค้าบางรายเพื่อตอบสนองความต้องการเฉพาะของผู้ให้บริการขนส่ง ซึ่งเจ้าของสินค้าอาจดูรายการข้อเสนอการขนส่งที่มีอยู่ในพื้นที่ของพวกเขาได้ตลอดเวลา และส่งข้อเสนอตอบกลับเพื่อตอบสนองข้อเสนอการขนส่งผ่านบริการ Platform เจ้าของสินค้าควรให้ข้อมูลที่จำเป็นทั้งหมดตามที่จำเป็นสำหรับการโพสต์ข้อเสนอตอบกลับลงในบริการ Platform<br>ผู้ให้บริการขนส่งที่มีข้อเสนอการขนส่งที่ยอมรับโดยเจ้าของสินค้า จะได้รับการรับเหมาให้ดำเนินบริการขนส่ง เมื่อสรุปการทำธุรกรรมบน Platform แล้ว บริการ Platform จะแจ้งเตือนให้ผู้ให้บริการขนส่งทราบว่าข้อเสนอการขนส่งได้รับการยอมรับแล้ว เจ้าของสินค้า และผู้ให้บริการขนส่ง จะได้รับข้อมูลการติดต่อและหมายเลขโทรศัพท์ของกันและกัน เจ้าของสินค้า และผู้ให้บริการขนส่งแต่ละรายมีหน้าที่จัดหาและใช้โทรศัพท์ของตนเองเพื่อใช้กับการดำเนินงาน และการปฏิบัติงานของบริการขนส่ง ซึ่ง Cargo Link อาจจะเชื่อมระหว่างเจ้าของสินค้า และผู้ให้บริการขนส่งจากภายนอกบริการ Platform เป็นครั้งคราว<br>ผู้ให้บริการขนส่ง และเจ้าของสินค้า จะต้องรับผิดชอบข้อมูลในข้อเสนอการขนส่ง และข้อเสนอ ซึ่ง Cargo Link จะไม่รับผิดชอบต่อข้อมูลใดๆ ในข้อเสนอการขนส่ง และข้อเสนอ และ Cargo Link ไม่รับประกันว่าข้อเสนอการขนส่งจะได้รับการตอบกลับจากเจ้าของสินค้า และข้อเสนอตอบกลับจะได้รับการยอมรับจากผู้ให้บริการขนส่ง<br>ผู้ให้บริการขนส่ง และเจ้าของสินค้า อาจยกเลิกข้อเสนอการขนส่ง และข้อเสนอตอบกลับเมื่อใดก็ได้ ก่อนที่เจ้าของสินค้าจะชำระเงินให้กับ Platform และผู้ให้บริการขนส่งได้รับการแจ้งเตือน หรือได้รับอีเมลจาก Cargo Link เพื่อแจ้งให้ทราบว่าเจ้าของสินค้าได้ยอมรับใบเสนอราคาของผู้ให้บริการขนส่ง<br>2.4 ข้อตกลงการขนส่ง: จะเป็นข้อตกลงสำหรับการให้บริการขนส่งที่จัดทำขึ้นระหว่าง Cargo Link และเจ้าของสินค้าบน Platform เมื่อใดก็ตามที่ใบเสนอราคา หรือข้อเสนอตอบกลับได้รับการยอมรับจากเจ้าของสินค้าแล้ว (“ข้อตกลงการขนส่ง”) เจ้าของสินค้าอาจยกเลิกข้อตกลงการขนส่งในเวลาใดก็ได้บน Platform เมื่อเจ้าของสินค้ากระทำเช่นนั้น ข้อตกลงที่เกี่ยวข้องกับผู้ให้บริการขนส่งจะถูกยกเลิกโดยอัตโนมัติบน Platform ดังกล่าว และเจ้าของสินค้าจะต้องรับผิดชอบค่าปรับต่อ Cargo Link ตามอัตราที่ระบุไว้ในวรรค 2.6 ด้านล่าง<br>2.5 ข้อตกลงสำหรับผู้ให้บริการขนส่ง: จะเป็นข้อตกลงระหว่าง Cargo Link และผู้ให้บริการขนส่งบน Platform สำหรับการให้บริการการขนส่งไปยังเจ้าของสินค้าเมื่อใดก็ตามที่ใบเสนอราคาหรือข้อเสนอตอบกลับได้รับการยอมรับโดยเจ้าของสินค้าหรือผู้ให้บริการขนส่งแล้ว (“ข้อตกลงสำหรับผู้ให้บริการขนส่ง”) ผู้ให้บริการขนส่งอาจยกเลิกข้อตกลงสำหรับผู้ให้บริการขนส่งได้ตลอดเวลาบน Platform เมื่อผู้ให้บริการขนส่งกระทำเช่นนั้น ข้อตกลงที่เกี่ยวข้องกับเจ้าของสินค้าจะถูกยกเลิกโดยอัตโนมัติบน Platform ดังกล่าว และผู้ให้บริการขนส่งจะต้องรับผิดชอบค่าปรับต่อ Cargo Link ตามอัตราที่ระบุไว้ในวรรค 2.6 ด้านล่าง:<br>2.6 การยกเลิกข้อตกลงการขนส่ง`
      }
  }
}
*/
